module attributes {tfl.description = "TOCO Converted.", tfl.schema_version = 3 : i32} {
  func.func @main(%arg0: tensor<1x384xi32>, %arg1: tensor<1x384xi32>, %arg2: tensor<1x384xi32>) -> (tensor<1x384xf32>, tensor<1x384xf32>) attributes {tf.entry_function = {inputs = "input_ids,input_mask,segment_ids", outputs = "end_logits,start_logits"}} {
    %0 = "tfl.cast"(%arg1) : (tensor<1x384xi32>) -> tensor<1x384xf32>
    %1 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x3xi32>} : () -> tensor<1x3xi32>
    %2 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %3 = "tfl.reshape"(%arg0, %2) : (tensor<1x384xi32>, tensor<3xi32>) -> tensor<1x384x1xi32>
    %4 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2x512xf32>} : () -> tensor<2x512xf32>
    %5 = "tfl.gather"(%4, %arg2) {axis = 0 : i32, batch_dims = 0 : i32} : (tensor<2x512xf32>, tensor<1x384xi32>) -> tensor<1x384x512xf32>
    %6 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %7 = "tfl.reshape"(%0, %6) : (tensor<1x384xf32>, tensor<3xi32>) -> tensor<1x1x384xf32>
    %8 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<30522x128xf32>} : () -> tensor<30522x128xf32>
    %9 = "tfl.gather"(%8, %3) {axis = 0 : i32, batch_dims = 0 : i32} : (tensor<30522x128xf32>, tensor<1x384x1xi32>) -> tensor<1x384x1x128xf32>
    %10 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<1x384x1xf32>} : () -> tensor<1x384x1xf32>
    %11 = tfl.mul(%10, %7) {fused_activation_function = "NONE"} : (tensor<1x384x1xf32>, tensor<1x1x384xf32>) -> tensor<1x384x384xf32>
    %12 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x384x512xf32>} : () -> tensor<1x384x512xf32>
    %13 = tfl.add %12, %5 {fused_activation_function = "NONE"} : tensor<1x384x512xf32>
    %14 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %15 = tfl.sub(%14, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %16 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %17 = tfl.sub(%16, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %18 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %19 = tfl.sub(%18, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %20 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %21 = tfl.sub(%20, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %22 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %23 = tfl.sub(%22, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %24 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %25 = tfl.sub(%24, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %26 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %27 = tfl.sub(%26, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %28 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %29 = tfl.sub(%28, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %30 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %31 = tfl.sub(%30, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %32 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %33 = tfl.sub(%32, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %34 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %35 = tfl.sub(%34, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %36 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %37 = tfl.sub(%36, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %38 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %39 = tfl.sub(%38, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %40 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %41 = tfl.sub(%40, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %42 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %43 = tfl.sub(%42, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %44 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %45 = tfl.sub(%44, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %46 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %47 = tfl.sub(%46, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %48 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %49 = tfl.sub(%48, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %50 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %51 = tfl.sub(%50, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %52 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %53 = tfl.sub(%52, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %54 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %55 = tfl.sub(%54, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %56 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %57 = tfl.sub(%56, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %58 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %59 = tfl.sub(%58, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %60 = "tfl.pseudo_const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %61 = tfl.sub(%60, %11) {fused_activation_function = "NONE"} : (tensor<f32>, tensor<1x384x384xf32>) -> tensor<1x384x384xf32>
    %62 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %63 = "tfl.reshape"(%9, %62) : (tensor<1x384x1x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %64 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %65 = tfl.mul(%15, %64) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %66 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %67 = tfl.mul(%17, %66) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %68 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %69 = tfl.mul(%19, %68) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %70 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %71 = tfl.mul(%21, %70) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %72 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %73 = tfl.mul(%23, %72) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %74 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %75 = tfl.mul(%25, %74) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %76 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %77 = tfl.mul(%27, %76) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %78 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %79 = tfl.mul(%29, %78) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %80 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %81 = tfl.mul(%31, %80) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %82 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %83 = tfl.mul(%33, %82) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %84 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %85 = tfl.mul(%35, %84) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %86 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %87 = tfl.mul(%37, %86) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %88 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %89 = tfl.mul(%39, %88) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %90 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %91 = tfl.mul(%41, %90) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %92 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %93 = tfl.mul(%43, %92) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %94 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %95 = tfl.mul(%45, %94) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %96 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %97 = tfl.mul(%47, %96) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %98 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %99 = tfl.mul(%49, %98) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %100 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %101 = tfl.mul(%51, %100) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %102 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %103 = tfl.mul(%53, %102) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %104 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %105 = tfl.mul(%55, %104) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %106 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %107 = tfl.mul(%57, %106) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %108 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %109 = tfl.mul(%59, %108) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %110 = "tfl.pseudo_const"() {value = dense<-1.000000e+04> : tensor<f32>} : () -> tensor<f32>
    %111 = tfl.mul(%61, %110) {fused_activation_function = "NONE"} : (tensor<1x384x384xf32>, tensor<f32>) -> tensor<1x384x384xf32>
    %112 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %113 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %114 = "tfl.pseudo_const"() {value = dense<1> : tensor<3xi32>} : () -> tensor<3xi32>
    %115 = "tfl.strided_slice"(%63, %112, %113, %114) {begin_mask = 5 : i32, ellipsis_mask = 0 : i32, end_mask = 7 : i32, new_axis_mask = 0 : i32, offset = false, shrink_axis_mask = 0 : i32} : (tensor<1x384x128xf32>, tensor<3xi32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x383x128xf32>
    %116 = "tfl.pseudo_const"() {value = dense<0> : tensor<3xi32>} : () -> tensor<3xi32>
    %117 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %118 = "tfl.pseudo_const"() {value = dense<1> : tensor<3xi32>} : () -> tensor<3xi32>
    %119 = "tfl.strided_slice"(%63, %116, %117, %118) {begin_mask = 7 : i32, ellipsis_mask = 0 : i32, end_mask = 5 : i32, new_axis_mask = 0 : i32, offset = false, shrink_axis_mask = 0 : i32} : (tensor<1x384x128xf32>, tensor<3xi32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x383x128xf32>
    %120 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %121 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %122 = "tfl.reshape"(%65, %121) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %123 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %124 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %125 = "tfl.reshape"(%67, %124) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %126 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %127 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %128 = "tfl.reshape"(%69, %127) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %129 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %130 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %131 = "tfl.reshape"(%71, %130) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %132 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %133 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %134 = "tfl.reshape"(%73, %133) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %135 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %136 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %137 = "tfl.reshape"(%75, %136) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %138 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %139 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %140 = "tfl.reshape"(%77, %139) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %141 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %142 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %143 = "tfl.reshape"(%79, %142) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %144 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %145 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %146 = "tfl.reshape"(%81, %145) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %147 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %148 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %149 = "tfl.reshape"(%83, %148) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %150 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %151 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %152 = "tfl.reshape"(%85, %151) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %153 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %154 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %155 = "tfl.reshape"(%87, %154) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %156 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %157 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %158 = "tfl.reshape"(%89, %157) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %159 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %160 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %161 = "tfl.reshape"(%91, %160) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %162 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %163 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %164 = "tfl.reshape"(%93, %163) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %165 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %166 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %167 = "tfl.reshape"(%95, %166) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %168 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %169 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %170 = "tfl.reshape"(%97, %169) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %171 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %172 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %173 = "tfl.reshape"(%99, %172) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %174 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %175 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %176 = "tfl.reshape"(%101, %175) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %177 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %178 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %179 = "tfl.reshape"(%103, %178) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %180 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %181 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %182 = "tfl.reshape"(%105, %181) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %183 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %184 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %185 = "tfl.reshape"(%107, %184) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %186 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %187 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %188 = "tfl.reshape"(%109, %187) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %189 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<1x4xi32>} : () -> tensor<1x4xi32>
    %190 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %191 = "tfl.reshape"(%111, %190) : (tensor<1x384x384xf32>, tensor<4xi32>) -> tensor<1x1x384x384xf32>
    %192 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3x2xi32>} : () -> tensor<3x2xi32>
    %193 = "tfl.pad"(%115, %192) : (tensor<1x383x128xf32>, tensor<3x2xi32>) -> tensor<1x384x128xf32>
    %194 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3x2xi32>} : () -> tensor<3x2xi32>
    %195 = "tfl.pad"(%119, %194) : (tensor<1x383x128xf32>, tensor<3x2xi32>) -> tensor<1x384x128xf32>
    %196 = "tfl.concatenation"(%193, %63, %195) {axis = 2 : i32, fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<1x384x128xf32>, tensor<1x384x128xf32>) -> tensor<1x384x384xf32>
    %197 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512x384xf32>} : () -> tensor<512x384xf32>
    %198 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %199 = "tfl.fully_connected"(%196, %197, %198) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x384xf32>, tensor<512x384xf32>, tensor<512xf32>) -> tensor<384x512xf32>
    %200 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %201 = "tfl.reshape"(%199, %200) : (tensor<384x512xf32>, tensor<3xi32>) -> tensor<1x384x512xf32>
    %202 = tfl.add %201, %13 {fused_activation_function = "NONE"} : tensor<1x384x512xf32>
    %203 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %204 = tfl.mul(%202, %203) {fused_activation_function = "NONE"} : (tensor<1x384x512xf32>, tensor<512xf32>) -> tensor<1x384x512xf32>
    %205 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %206 = tfl.add(%204, %205) {fused_activation_function = "NONE"} : (tensor<1x384x512xf32>, tensor<512xf32>) -> tensor<1x384x512xf32>
    %207 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %208 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %209 = "tfl.fully_connected"(%206, %207, %208) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %210 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %211 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %212 = "tfl.fully_connected"(%206, %210, %211) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %213 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %214 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %215 = "tfl.fully_connected"(%206, %213, %214) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %216 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %217 = "tfl.reshape"(%209, %216) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %218 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %219 = "tfl.reshape"(%212, %218) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %220 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %221 = "tfl.reshape"(%215, %220) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %222 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x128xf32>} : () -> tensor<128x128xf32>
    %223 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %224 = "tfl.fully_connected"(%219, %222, %223) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<128x128xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %225 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x128xf32>} : () -> tensor<128x128xf32>
    %226 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %227 = "tfl.fully_connected"(%219, %225, %226) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<128x128xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %228 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x128xf32>} : () -> tensor<128x128xf32>
    %229 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %230 = "tfl.fully_connected"(%221, %228, %229) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<128x128xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %231 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %232 = "tfl.reshape"(%224, %231) : (tensor<384x128xf32>, tensor<4xi32>) -> tensor<1x384x4x32xf32>
    %233 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %234 = "tfl.reshape"(%227, %233) : (tensor<384x128xf32>, tensor<4xi32>) -> tensor<1x384x4x32xf32>
    %235 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %236 = "tfl.reshape"(%230, %235) : (tensor<384x128xf32>, tensor<4xi32>) -> tensor<1x384x4x32xf32>
    %237 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %238 = "tfl.transpose"(%232, %237) : (tensor<1x384x4x32xf32>, tensor<4xi32>) -> tensor<1x4x384x32xf32>
    %239 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %240 = "tfl.transpose"(%234, %239) : (tensor<1x384x4x32xf32>, tensor<4xi32>) -> tensor<1x4x384x32xf32>
    %241 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %242 = "tfl.transpose"(%236, %241) : (tensor<1x384x4x32xf32>, tensor<4xi32>) -> tensor<1x4x384x32xf32>
    %243 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %244 = "tfl.transpose"(%240, %243) : (tensor<1x4x384x32xf32>, tensor<4xi32>) -> tensor<1x4x32x384xf32>
    %245 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %246 = "tfl.reshape"(%238, %245) : (tensor<1x4x384x32xf32>, tensor<3xi32>) -> tensor<4x384x32xf32>
    %247 = "tfl.pseudo_const"() {value = dense<0> : tensor<3xi32>} : () -> tensor<3xi32>
    %248 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %249 = "tfl.slice"(%246, %247, %248) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %250 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %251 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %252 = "tfl.slice"(%246, %250, %251) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %253 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %254 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %255 = "tfl.slice"(%246, %253, %254) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %256 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %257 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %258 = "tfl.slice"(%246, %256, %257) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %259 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %260 = "tfl.reshape"(%244, %259) : (tensor<1x4x32x384xf32>, tensor<3xi32>) -> tensor<4x32x384xf32>
    %261 = "tfl.pseudo_const"() {value = dense<0> : tensor<3xi32>} : () -> tensor<3xi32>
    %262 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %263 = "tfl.slice"(%260, %261, %262) : (tensor<4x32x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x32x384xf32>
    %264 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %265 = "tfl.transpose"(%263, %264) : (tensor<1x32x384xf32>, tensor<3xi32>) -> tensor<384x32x1xf32>
    %266 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %267 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %268 = "tfl.slice"(%260, %266, %267) : (tensor<4x32x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x32x384xf32>
    %269 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %270 = "tfl.transpose"(%268, %269) : (tensor<1x32x384xf32>, tensor<3xi32>) -> tensor<384x32x1xf32>
    %271 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %272 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %273 = "tfl.slice"(%260, %271, %272) : (tensor<4x32x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x32x384xf32>
    %274 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %275 = "tfl.transpose"(%273, %274) : (tensor<1x32x384xf32>, tensor<3xi32>) -> tensor<384x32x1xf32>
    %276 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %277 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %278 = "tfl.slice"(%260, %276, %277) : (tensor<4x32x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x32x384xf32>
    %279 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %280 = "tfl.transpose"(%278, %279) : (tensor<1x32x384xf32>, tensor<3xi32>) -> tensor<384x32x1xf32>
    %281 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %282 = "tfl.reshape"(%265, %281) : (tensor<384x32x1xf32>, tensor<2xi32>) -> tensor<384x32xf32>
    %283 = "tfl.pseudo_const"() {value = dense<0.000000e+00> : tensor<384xf32>} : () -> tensor<384xf32>
    %284 = "tfl.fully_connected"(%249, %282, %283) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x32xf32>, tensor<384x32xf32>, tensor<384xf32>) -> tensor<384x384xf32>
    %285 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %286 = "tfl.reshape"(%270, %285) : (tensor<384x32x1xf32>, tensor<2xi32>) -> tensor<384x32xf32>
    %287 = "tfl.fully_connected"(%252, %286, %283) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x32xf32>, tensor<384x32xf32>, tensor<384xf32>) -> tensor<384x384xf32>
    %288 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %289 = "tfl.reshape"(%275, %288) : (tensor<384x32x1xf32>, tensor<2xi32>) -> tensor<384x32xf32>
    %290 = "tfl.fully_connected"(%255, %289, %283) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x32xf32>, tensor<384x32xf32>, tensor<384xf32>) -> tensor<384x384xf32>
    %291 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %292 = "tfl.reshape"(%280, %291) : (tensor<384x32x1xf32>, tensor<2xi32>) -> tensor<384x32xf32>
    %293 = "tfl.fully_connected"(%258, %292, %283) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x32xf32>, tensor<384x32xf32>, tensor<384xf32>) -> tensor<384x384xf32>
    %294 = "tfl.pack"(%284, %287, %290, %293) {axis = 0 : i32, values_count = 4 : i32} : (tensor<384x384xf32>, tensor<384x384xf32>, tensor<384x384xf32>, tensor<384x384xf32>) -> tensor<4x384x384xf32>
    %295 = "tfl.pseudo_const"() {value = dense<0.176776692> : tensor<f32>} : () -> tensor<f32>
    %296 = tfl.mul(%294, %295) {fused_activation_function = "NONE"} : (tensor<4x384x384xf32>, tensor<f32>) -> tensor<4x384x384xf32>
    %297 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %298 = "tfl.reshape"(%296, %297) : (tensor<4x384x384xf32>, tensor<4xi32>) -> tensor<1x4x384x384xf32>
    %299 = tfl.add(%298, %122) {fused_activation_function = "NONE"} : (tensor<1x4x384x384xf32>, tensor<1x1x384x384xf32>) -> tensor<1x4x384x384xf32>
    %300 = "tfl.softmax"(%299) {beta = 1.000000e+00 : f32} : (tensor<1x4x384x384xf32>) -> tensor<1x4x384x384xf32>
    %301 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %302 = "tfl.reshape"(%300, %301) : (tensor<1x4x384x384xf32>, tensor<3xi32>) -> tensor<4x384x384xf32>
    %303 = "tfl.pseudo_const"() {value = dense<0> : tensor<3xi32>} : () -> tensor<3xi32>
    %304 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %305 = "tfl.slice"(%302, %303, %304) : (tensor<4x384x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x384xf32>
    %306 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %307 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %308 = "tfl.slice"(%302, %306, %307) : (tensor<4x384x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x384xf32>
    %309 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %310 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %311 = "tfl.slice"(%302, %309, %310) : (tensor<4x384x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x384xf32>
    %312 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %313 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %314 = "tfl.slice"(%302, %312, %313) : (tensor<4x384x384xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x384xf32>
    %315 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %316 = "tfl.reshape"(%242, %315) : (tensor<1x4x384x32xf32>, tensor<3xi32>) -> tensor<4x384x32xf32>
    %317 = "tfl.pseudo_const"() {value = dense<0> : tensor<3xi32>} : () -> tensor<3xi32>
    %318 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %319 = "tfl.slice"(%316, %317, %318) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %320 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %321 = "tfl.transpose"(%319, %320) : (tensor<1x384x32xf32>, tensor<3xi32>) -> tensor<32x384x1xf32>
    %322 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %323 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %324 = "tfl.slice"(%316, %322, %323) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %325 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %326 = "tfl.transpose"(%324, %325) : (tensor<1x384x32xf32>, tensor<3xi32>) -> tensor<32x384x1xf32>
    %327 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %328 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %329 = "tfl.slice"(%316, %327, %328) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %330 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %331 = "tfl.transpose"(%329, %330) : (tensor<1x384x32xf32>, tensor<3xi32>) -> tensor<32x384x1xf32>
    %332 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %333 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %334 = "tfl.slice"(%316, %332, %333) : (tensor<4x384x32xf32>, tensor<3xi32>, tensor<3xi32>) -> tensor<1x384x32xf32>
    %335 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %336 = "tfl.transpose"(%334, %335) : (tensor<1x384x32xf32>, tensor<3xi32>) -> tensor<32x384x1xf32>
    %337 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %338 = "tfl.reshape"(%321, %337) : (tensor<32x384x1xf32>, tensor<2xi32>) -> tensor<32x384xf32>
    %339 = "tfl.pseudo_const"() {value = dense<0.000000e+00> : tensor<32xf32>} : () -> tensor<32xf32>
    %340 = "tfl.fully_connected"(%305, %338, %339) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x384xf32>, tensor<32x384xf32>, tensor<32xf32>) -> tensor<384x32xf32>
    %341 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %342 = "tfl.reshape"(%326, %341) : (tensor<32x384x1xf32>, tensor<2xi32>) -> tensor<32x384xf32>
    %343 = "tfl.fully_connected"(%308, %342, %339) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x384xf32>, tensor<32x384xf32>, tensor<32xf32>) -> tensor<384x32xf32>
    %344 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %345 = "tfl.reshape"(%331, %344) : (tensor<32x384x1xf32>, tensor<2xi32>) -> tensor<32x384xf32>
    %346 = "tfl.fully_connected"(%311, %345, %339) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x384xf32>, tensor<32x384xf32>, tensor<32xf32>) -> tensor<384x32xf32>
    %347 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<2xi32>} : () -> tensor<2xi32>
    %348 = "tfl.reshape"(%336, %347) : (tensor<32x384x1xf32>, tensor<2xi32>) -> tensor<32x384xf32>
    %349 = "tfl.fully_connected"(%314, %348, %339) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x384xf32>, tensor<32x384xf32>, tensor<32xf32>) -> tensor<384x32xf32>
    %350 = "tfl.pack"(%340, %343, %346, %349) {axis = 0 : i32, values_count = 4 : i32} : (tensor<384x32xf32>, tensor<384x32xf32>, tensor<384x32xf32>, tensor<384x32xf32>) -> tensor<4x384x32xf32>
    %351 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %352 = "tfl.transpose"(%350, %351) : (tensor<4x384x32xf32>, tensor<3xi32>) -> tensor<384x4x32xf32>
    %353 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<4xi32>} : () -> tensor<4xi32>
    %354 = "tfl.reshape"(%352, %353) : (tensor<384x4x32xf32>, tensor<4xi32>) -> tensor<1x384x4x32xf32>
    %355 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x128xf32>} : () -> tensor<128x128xf32>
    %356 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %357 = "tfl.fully_connected"(%354, %355, %356) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x4x32xf32>, tensor<128x128xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %358 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %359 = "tfl.reshape"(%357, %358) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %360 = tfl.add %359, %217 {fused_activation_function = "NONE"} : tensor<1x384x128xf32>
    %361 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %362 = tfl.mul(%360, %361) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %363 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %364 = tfl.add(%362, %363) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %365 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512x128xf32>} : () -> tensor<512x128xf32>
    %366 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %367 = "tfl.fully_connected"(%364, %365, %366) {asymmetric_quantize_inputs = false, fused_activation_function = "RELU", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<512x128xf32>, tensor<512xf32>) -> tensor<384x512xf32>
    %368 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %369 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %370 = "tfl.fully_connected"(%367, %368, %369) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %371 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %372 = "tfl.reshape"(%370, %371) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %373 = tfl.add %372, %364 {fused_activation_function = "NONE"} : tensor<1x384x128xf32>
    %374 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %375 = tfl.mul(%373, %374) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %376 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %377 = tfl.add(%375, %376) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %378 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512x128xf32>} : () -> tensor<512x128xf32>
    %379 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %380 = "tfl.fully_connected"(%377, %378, %379) {asymmetric_quantize_inputs = false, fused_activation_function = "RELU", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<512x128xf32>, tensor<512xf32>) -> tensor<384x512xf32>
    %381 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %382 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %383 = "tfl.fully_connected"(%380, %381, %382) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %384 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %385 = "tfl.reshape"(%383, %384) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %386 = tfl.add %385, %377 {fused_activation_function = "NONE"} : tensor<1x384x128xf32>
    %387 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %388 = tfl.mul(%386, %387) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %389 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %390 = tfl.add(%388, %389) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %391 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512x128xf32>} : () -> tensor<512x128xf32>
    %392 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %393 = "tfl.fully_connected"(%390, %391, %392) {asymmetric_quantize_inputs = false, fused_activation_function = "RELU", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<512x128xf32>, tensor<512xf32>) -> tensor<384x512xf32>
    %394 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %395 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %396 = "tfl.fully_connected"(%393, %394, %395) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %397 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %398 = "tfl.reshape"(%396, %397) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %399 = tfl.add %398, %390 {fused_activation_function = "NONE"} : tensor<1x384x128xf32>
    %400 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %401 = tfl.mul(%399, %400) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %402 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %403 = tfl.add(%401, %402) {fused_activation_function = "NONE"} : (tensor<1x384x128xf32>, tensor<128xf32>) -> tensor<1x384x128xf32>
    %404 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512x128xf32>} : () -> tensor<512x128xf32>
    %405 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<512xf32>} : () -> tensor<512xf32>
    %406 = "tfl.fully_connected"(%403, %404, %405) {asymmetric_quantize_inputs = false, fused_activation_function = "RELU", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<1x384x128xf32>, tensor<512x128xf32>, tensor<512xf32>) -> tensor<384x512xf32>
    %407 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128x512xf32>} : () -> tensor<128x512xf32>
    %408 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %409 = "tfl.fully_connected"(%406, %407, %408) {asymmetric_quantize_inputs = false, fused_activation_function = "NONE", keep_num_dims = false, weights_format = "DEFAULT"} : (tensor<384x512xf32>, tensor<128x512xf32>, tensor<128xf32>) -> tensor<384x128xf32>
    %410 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<3xi32>} : () -> tensor<3xi32>
    %411 = "tfl.reshape"(%409, %410) : (tensor<384x128xf32>, tensor<3xi32>) -> tensor<1x384x128xf32>
    %412 = tfl.add %411, %403 {fused_activation_function = "NONE"} : tensor<1x384x128xf32>
    %413 = "tfl.pseudo_const"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
