module attributes {tfl.description = "TOCO Converted.", tfl.schema_version = 3 : i32} {
  func.func @main(%arg0: tensor<1x384xi32>, %arg1: tensor<1x384xi32>, %arg2: tensor<1x384xi32>) -> (tensor<1x384xf32>, tensor<1x384xf32>) attributes {tf.entry_function = {inputs = "input_ids,input_mask,segment_ids", outputs = "end_logits,start_logits"}} {
    %cst = arith.constant dense_resource<__elided__> : tensor<4xi32>
    %0 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<f32>}> : () -> tensor<f32>
    %1 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %2 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %3 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %4 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %5 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %6 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %7 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %8 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %9 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %10 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %11 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %12 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %13 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %14 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %15 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %16 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %17 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %18 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %19 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %20 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %21 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %22 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %23 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %24 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %25 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %26 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %27 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %28 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %29 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %30 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %31 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %32 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %33 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %34 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %35 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %36 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %37 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %38 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %39 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %40 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %41 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %42 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %43 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %44 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %45 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %46 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %47 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %48 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %49 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %50 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %51 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %52 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %53 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %54 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %55 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %56 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %57 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %58 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %59 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %60 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %61 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %62 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %63 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %64 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %65 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %66 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %67 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %68 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %69 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %70 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %71 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %72 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %73 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %74 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %75 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %76 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %77 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %78 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %79 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %80 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %81 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %82 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %83 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %84 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %85 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %86 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %87 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %88 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %89 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %90 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %91 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %92 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %93 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %94 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %95 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %96 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %97 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %98 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %99 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %100 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %101 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %102 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %103 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %104 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %105 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %106 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %107 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %108 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %109 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %110 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %111 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %112 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %113 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %114 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %115 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %116 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %117 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %118 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %119 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %120 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %121 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %122 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %123 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %124 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %125 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %126 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %127 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %128 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %129 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %130 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %131 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %132 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %133 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %134 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %135 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %136 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %137 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %138 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %139 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %140 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %141 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %142 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %143 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %144 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %145 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %146 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %147 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %148 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %149 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %150 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %151 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %152 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %153 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %154 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %155 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %156 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %157 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %158 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %159 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %160 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %161 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %162 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %163 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %164 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %165 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %166 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %167 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %168 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %169 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %170 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %171 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %172 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %173 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %174 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %175 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %176 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %177 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %178 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %179 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %180 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %181 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %182 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %183 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %184 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %185 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %186 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %187 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %188 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %189 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %190 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %191 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %192 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %193 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %194 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %195 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %196 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %197 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %198 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %199 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %200 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %201 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %202 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %203 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %204 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %205 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %206 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %207 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %208 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %209 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %210 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %211 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %212 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %213 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %214 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %215 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %216 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %217 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %218 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %219 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %220 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %221 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %222 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %223 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %224 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %225 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %226 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %227 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %228 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %229 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %230 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %231 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %232 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %233 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %234 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %235 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %236 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %237 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %238 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %239 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %240 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %241 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %242 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %243 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %244 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %245 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %246 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %247 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %248 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %249 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %250 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %251 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %252 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %253 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %254 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %255 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %256 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %257 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %258 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %259 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %260 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %261 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %262 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %263 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %264 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %265 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %266 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %267 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %268 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %269 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %270 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %271 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %272 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %273 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %274 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %275 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %276 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %277 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %278 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %279 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %280 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %281 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %282 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %283 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %284 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %285 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %286 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %287 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %288 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x128xf32>}> : () -> tensor<1x1x128xf32>
    %289 = "tosa.const"() <{value = dense<0.176776692> : tensor<1x1x1xf32>}> : () -> tensor<1x1x1xf32>
    %290 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %291 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x1x512xf32>}> : () -> tensor<1x1x512xf32>
    %292 = "tosa.const"() <{value = dense<-1.000000e+04> : tensor<1x1x1xf32>}> : () -> tensor<1x1x1xf32>
    %293 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x1x1xf32>}> : () -> tensor<1x1x1xf32>
    %294 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<32xf32>}> : () -> tensor<32xf32>
    %295 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<384xf32>}> : () -> tensor<384xf32>
    %296 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x30522x128xf32>}> : () -> tensor<1x30522x128xf32>
    %297 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<1x2x512xf32>}> : () -> tensor<1x2x512xf32>
    %298 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<2xi32>}> : () -> tensor<2xi32>
    %299 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<2xf32>}> : () -> tensor<2xf32>
    %300 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<2x512xf32>}> : () -> tensor<2x512xf32>
    %301 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %302 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %303 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %304 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %305 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %306 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %307 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %308 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %309 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %310 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %311 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %312 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %313 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %314 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %315 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %316 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %317 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %318 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %319 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %320 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %321 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %322 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %323 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %324 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %325 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %326 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %327 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %328 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %329 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %330 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %331 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %332 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %333 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %334 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %335 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %336 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %337 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %338 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %339 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %340 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %341 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %342 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %343 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %344 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %345 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %346 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %347 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %348 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %349 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %350 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %351 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %352 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %353 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %354 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %355 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %356 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %357 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %358 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %359 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %360 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %361 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %362 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %363 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %364 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %365 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %366 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %367 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %368 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %369 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %370 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %371 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %372 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %373 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %374 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %375 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %376 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %377 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %378 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %379 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %380 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %381 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %382 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %383 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %384 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %385 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %386 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %387 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %388 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %389 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %390 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %391 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %392 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %393 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %394 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %395 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %396 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %397 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %398 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %399 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %400 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %401 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %402 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %403 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %404 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %405 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %406 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %407 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %408 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %409 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %410 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %411 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %412 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %413 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %414 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %415 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %416 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %417 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %418 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %419 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %420 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %421 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %422 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x128xf32>}> : () -> tensor<128x128xf32>
    %423 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %424 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %425 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %426 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %427 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %428 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %429 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %430 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %431 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %432 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
    %433 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512xf32>}> : () -> tensor<512xf32>
    %434 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<512x128xf32>}> : () -> tensor<512x128xf32>
    %435 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128xf32>}> : () -> tensor<128xf32>
    %436 = "tosa.const"() <{value = dense_resource<__elided__> : tensor<128x512xf32>}> : () -> tensor<128x512xf32>
